{
  "topProjects": [
    {
      "title": "Listening Habits",
      "description": "A web application for viewing Spotify data such as a user's top tracks, artists and genres. Track and artist data retrieved from Spotify Web API, with top genres then being calculated from this data. The front end is built with React, with a Node.js back end for authorization.",
      "imageUrl": "listeninghabits.jpg",
      "alt": "Listening Habits App",
      "tags": ["JavaScript", "React", "Node.js", "Express", "Spotify Web API"],
      "githubRepo": "https://github.com/joshcodd/listening-habits",
      "liveLink": "https://listening-habits.herokuapp.com/",
      "float": "right"
    },
    {
      "title": "Sorting Visualizer",
      "description": "A web application to visualize various sorting algorithms. Collection size can be adjusted as well as the speed of the sort. I built this to revise sorting algorithms further and to learn React!",
      "imageUrl": "sortingvisualizer.jpg",
      "alt": "Sorting Visualizer App",
      "tags": ["JavaScript", "React"],
      "githubRepo": "https://github.com/joshcodd/sorting-visualizer",
      "liveLink": "https://joshcodd.github.io/sorting-visualizer/",
      "float": "left"
    }
  ],
  "otherProjects": [
    {
      "title": "Labyrinth",
      "description": "An implementation of the board game Labyrinth using Java. This project was produced as coursework for CS-230: Software Development, in which I took the role of the project manager. This involved me organising how the project was going to be implemented, managing other members of the team and also developing the game myself. I learned a lot about building software as a team and improved my leadership skills. I also learned JaxaFx/GUI programming in Java. I found success in this project and role, achieving 100% in the assignment, along with receiving excellent feedback.",
      "tags": ["Java", "JavaFX"],
      "githubRepo": "https://github.com/joshcodd/Labyrinth",
      "liveLink": null
    },
    {
      "title": "Zoom Lectures prototype",
      "description": "A prototype for an improvement to video conferencing software, Zoom. When using Zoom for university, I observed an issue with the use of the chat feed during lectures, making it hard to interact with the lecturer. This prototype was built to be demonstrated as part of an assignment and features a live chat with the ability to upvote and downvote questions. Top questions are always displayed for all participants and can be spoken using text-to-speech.",
      "tags": ["JavaScript", "React", "Firebase"],
      "githubRepo": "https://github.com/joshcodd/zoom-prototype",
      "liveLink": "https://joshcodd.github.io/zoom-prototype/"
    },
    {
      "title": "jcodd.tech",
      "description": "You're currently looking at this project! I built this website using React to use as a CV. When building this application I decided to learn about styled-components and Next.js.",
      "tags": ["Javascript", "React", "Next.js"],
      "githubRepo": "https://github.com/joshcodd/jcodd.tech",
      "liveLink": "https://jcodd.tech"
    }
  ]
}
